tap "cargo-lambda/cargo-lambda"
tap "hashicorp/tap"
tap "homebrew/services"
tap "localstack/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "quantonganh/tap"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU multiple precision arithmetic library
brew "gmp"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Official Amazon AWS command-line interface
brew "awscli"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# .NET Core
brew "dotnet"
# Device tree compiler
brew "dtc"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# GNU Emacs text editor
brew "emacs"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# XSL-FO print formatter for making PDF or PS documents
brew "fop"
# GitHub command-line tool
brew "gh"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Perfect hash function generator
brew "gperf"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Ranger-like terminal file manager written in Rust
brew "joshuto"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Simple terminal UI for git commands
brew "lazygit"
# DNS library written in C
brew "ldns"
# Implementation of the file(1) command
brew "libmagic"
# Library for complex text layout
brew "libraqm"
# NaCl networking and cryptography library
brew "libsodium"
# C XSLT library for GNOME
brew "libxslt"
# Next-gen compiler infrastructure
brew "llvm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Display the PID number for a given process name
brew "pidof"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@14"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Simple keystroke visualizer
brew "showkey"
# Simple TTY terminal I/O application
brew "tio"
# Internet file retriever
brew "wget"
# Cargo Lambda is a Cargo subcommand to help you work with AWS Lambda.
brew "cargo-lambda/cargo-lambda/cargo-lambda"
# Vault
brew "hashicorp/tap/vault"
# Localstack cli packaged using pyinstaller
brew "localstack/tap/localstack-cli"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@8"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Create global hotkeys for your files and applications
cask "apptivate"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
# 3D parametric modeller
cask "freecad"
# Pre-built GNU bare-metal toolchain for 32-bit Arm processors
cask "gcc-arm-embedded"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your emails and files
cask "gpg-suite"
# Grammarly for desktop
cask "grammarly-desktop"
# Open-source keystroke visualiser
cask "keycastr"
# App to write, plan, collaborate, and get organised
cask "notion"
# Programmable solid 3D CAD modeller
cask "openscad"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Kubernetes and container management on the desktop
cask "rancher"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Rust IDE
cask "rustrover"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Messaging app with a focus on speed and security
cask "telegram"
# Virtualiser for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "42crunch.vscode-openapi"
vscode "bmewburn.vscode-intelephense-client"
vscode "eamodio.gitlens"
vscode "elmtooling.elm-ls-vscode"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gp-pereira.refatorex"
vscode "hbenl.vscode-test-explorer"
vscode "ionide.ionide-fsharp"
vscode "jakebecker.elixir-ls"
vscode "lexical-lsp.lexical"
vscode "mhutchie.git-graph"
vscode "mksafi.find-word-at-cursor"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pgourlain.erlang"
vscode "plex.vscode-protolint"
vscode "plorefice.devicetree"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "spadin.zmk-tools"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "xdebug.php-debug"
vscode "zxh404.vscode-proto3"
